app/views/item_taxes/_form.html.erb

SELECT "items".* FROM "items" ORDER BY "items"."name" ASC
---
    <%= form.label :item_id %>
      <%= form.collection_select :item_id, Item.order(:name), :id, :name, include_blank: true %>