app/views/items/_form.html.erb

    <%#= form.text_field :item_category_id %>
     <%= form.collection_select :item_category_id, ItemCategory.order(:name), :id, :name, include_blank: true %>
---
SELECT "item_categories".* FROM "item_categories" ORDER BY "item_categories"."name" ASC