app/views/items/total_result.html.erb

      <tr>
        <td><%= Item.where(id: item).first.name %></td>
        <td><%= Item.where(id: item).first.rate %></td>
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]