app/controllers/item_taxes_controller.rb

SELECT "item_taxes".* FROM "item_taxes"
---
  def index
    @item_taxes = ItemTax.all

INSERT INTO "item_taxes" ("tax", "tax_type", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["tax", 3.0], ["tax_type", "Percentage"], ["item_id", 1], ["created_at", "2019-03-24 17:20:50.214414"], ["updated_at", "2019-03-24 17:20:50.214414"]]
---
  def create
    @item_tax = ItemTax.new(item_tax_params)

    respond_to do |format|
      if @item_tax.save

SELECT  "item_taxes".* FROM "item_taxes" WHERE "item_taxes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_item_tax
      @item_tax = ItemTax.find(params[:id])