app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)
    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "rate", "item_category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Apple"], ["rate", 50.0], ["item_category_id", 1], ["created_at", "2019-03-24 17:17:36.775844"], ["updated_at", "2019-03-24 17:17:36.775844"]]

  def total_result
    @items=params[:item_ids]
    @subtotal=[]
    @items.each do |itm|
      @subtotal << Item.where(id: itm).first.rate
    end
    @subtotal.inspect
    sum(@subtotal)
    @result=[]
    @final=0
    params[:item_ids].each do |it|
      item=Item.where(id: it).first
---
INSERT INTO "items" ("name", "rate", "item_category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Apple"], ["rate", 50.0], ["item_category_id", 1], ["created_at", "2019-03-24 17:17:36.775844"], ["updated_at", "2019-03-24 17:17:36.775844"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? ORDER BY "items"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]